MyHome/src/Documents/Гарантия/Гарантия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Гарантия</name>
  <registerRecords>InformationRegister.Гарантия</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПокупки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГарантияМес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Documents/Гарантия/ManagerModule.bsl
#Область ДвиженияДокумента

Процедура ИнициализироватьТаблицыДляДвижений(ДокументОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГарантияТовары.Ссылка,
	|	ГарантияТовары.Номенклатура,
	|	ГарантияТовары.ДатаПокупки,
	|	ГарантияТовары.ГарантийныйСрок,
	|	ГарантияТовары.ГарантияМес
	|ИЗ
	|	Документ.Гарантия.Товары КАК ГарантияТовары
	|ГДЕ
	|	ГарантияТовары.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ДвиженияГарантия"	, РезультатЗапроса[0].Выгрузить());
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", СтруктураРезультата);
	
КонецПроцедуры

Процедура ОтразитьДвиженияГарантия(Документ, Отказ) Экспорт
	
	ТаблицаДвижений = Документ.ДополнительныеСвойства.ТаблицыДляДвижений.ДвиженияГарантия;
	
	Если Отказ ИЛИ ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияГарантия = Документ.Движения.Гарантия;
	ДвиженияГарантия.Записывать = Истина;
	ДвиженияГарантия.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

#КонецОбласти
